content/posts/video_streaming.md
+++
title = "video streaming"
author = ["Cameron Smith"]
lastmod = 2020-09-24T19:53:11-04:00
slug = "video_streaming"
draft = false
+++

## [screencasting]({{< relref "screencasting" >}}) {#screencasting--screencasting-dot-md}


## summary {#summary}


### use obs studio to aggregate content from your computer for streaming {#use-obs-studio-to-aggregate-content-from-your-computer-for-streaming}


### use reastream.io for simulcasting to youtube, twitch, periscope/twitter, linkedin, and facebook {#use-reastream-dot-io-for-simulcasting-to-youtube-twitch-periscope-twitter-linkedin-and-facebook}


## simulcasting {#simulcasting}


### broadcast multiple streams yourself {#broadcast-multiple-streams-yourself}

<!--list-separator-->

-  [How To Use OBS Studio To Live Stream \* Twitch and YouTube](https://www.youtube.com/watch?v=BgpDb1XDDfY)

<!--list-separator-->

-  con: load on computer and network, questionable ability to integrate chat from the different platforms into a single thread though what if it's disabled and just enabled in a livestream channel in a discord group?


### use a simulcast platform to offload the task of producing multiple streams {#use-a-simulcast-platform-to-offload-the-task-of-producing-multiple-streams}

<!--list-separator-->

-  to stream to multiple channels (youtube, twitch +/\* facebook live) with integrated chat

    <!--list-separator-->

    -  [Live Stream to Multiple Platforms at the same time (How to Simulcast!)](https://www.youtube.com/watch?v=sMLEZb0k1YE)

    <!--list-separator-->

    -  [Restream VS Castr Comparison. Which is the best multi-streaming service?](https://www.youtube.com/watch?v=5hOgmnz16fw)

        <!--list-separator-->

        -  claim: restream is better than castr

    <!--list-separator-->

    -  <https://castr.io/> for about $100-120/year

    <!--list-separator-->

    -  <https://streamyard.com/destinations/connect> about $25/mo


## resources {#resources}


### [Streamlabs OBS (SLOBS) vs OBS Studio. Which One is Better?!](https://www.youtube.com/watch?v=OnGkE0w9JrE) {#streamlabs-obs--slobs--vs-obs-studio-dot-which-one-is-better}

<!--list-separator-->

-  claim: obs studio is better than streamlabs obs for the vast majority of people

<!--list-separator-->

-  note: you cannot even stream to twitch and youtube simultaneously from streamlabs obs (you can only pair either with facebook) as of <span class="timestamp-wrapper"><span class="timestamp">&lt;2020-05-21 Thu&gt;</span></span>


### [Recommended Gear, Tools & Resources \* Primal Video](https://primalvideo.com/resources/) {#recommended-gear-tools-and-resources-primal-video}
